import logging
import os


# ---------------------------------------------------------
# Папка, где будут храниться логи программы
# ---------------------------------------------------------
LOG_DIR = "logs/logs"


# ---------------------------------------------------------
# Если папки logs ещё нет, создаём её автоматически
# exist_ok=True означает:
# "не выдавай ошибку, если папка уже существует"
# ---------------------------------------------------------
os.makedirs(LOG_DIR, exist_ok=True)


# ---------------------------------------------------------
# Полный путь к файлу логов
# ---------------------------------------------------------
LOG_FILE = os.path.join(LOG_DIR, "app.log")


# ---------------------------------------------------------
# Создаём отдельный logger для нашего приложения
#
# Имя "university_app" можно потом использовать в разных
# файлах проекта, чтобы все записи шли в один лог
# ---------------------------------------------------------
logger = logging.getLogger("university_app")


# ---------------------------------------------------------
# Уровень логирования
#
# DEBUG    - техническая информация для разработчика
# INFO     - обычные действия программы
# WARNING  - что-то подозрительное, но программа работает
# ERROR    - произошла ошибка
# CRITICAL - серьёзная ошибка
#
# Для нашего проекта достаточно DEBUG, чтобы сохранялось всё
# ---------------------------------------------------------
logger.setLevel(logging.DEBUG)


# ---------------------------------------------------------
# Проверяем, не добавлен ли обработчик раньше
#
# Это нужно, чтобы при повторном импорте logger
# одна и та же запись не дублировалась несколько раз
# ---------------------------------------------------------
if not logger.handlers:

    # -----------------------------------------------------
    # FileHandler отвечает за запись логов в файл
    # -----------------------------------------------------
    file_handler = logging.FileHandler(
        LOG_FILE,
        encoding="utf-8"
    )

    # -----------------------------------------------------
    # В файл записываем сообщения начиная с DEBUG
    # -----------------------------------------------------
    file_handler.setLevel(logging.DEBUG)


    # -----------------------------------------------------
    # Формат одной строки в app.log
    #
    # Например:
    #
    # 2026-10-06 22:40:15 | INFO | Student added: ID=1
    #
    # %(asctime)s   - дата и время
    # %(levelname)s - уровень INFO / ERROR / WARNING...
    # %(message)s   - наш текст сообщения
    # -----------------------------------------------------
    formatter = logging.Formatter(
        "%(asctime)s | %(levelname)s | %(message)s",
        datefmt="%Y-%m-%d %H:%M:%S"
    )

    file_handler.setFormatter(formatter)


    # -----------------------------------------------------
    # Подключаем FileHandler к logger
    # -----------------------------------------------------
    logger.addHandler(file_handler)